; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	thermograph3 - mode
	spectrograph2 - mode
	spectrograph1 - mode
	image0 - mode
	GroundStation0 - direction
	Star2 - direction
	Star5 - direction
	Star6 - direction
	Star9 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation1 - direction
	GroundStation7 - direction
	Star8 - direction
	Star10 - direction
	Star11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Planet15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph1)
	(supports instrument0 thermograph3)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation4)
	(calibration_target instrument0 GroundStation7)
	(supports instrument1 image0)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation7)
	(calibration_target instrument1 Star8)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument2 image0)
	(calibration_target instrument2 Star8)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet13)
)
(:goal (and
	(pointing satellite0 Star6)
	(have_image Star10 spectrograph1)
	(have_image Star11 image0)
	(have_image Planet12 spectrograph1)
	(have_image Planet13 image0)
	(have_image Phenomenon14 spectrograph1)
	(have_image Planet15 spectrograph2)
	(have_image Star16 spectrograph1)
))

)

; plan
1. (turn_to satellite0 groundstation1 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 8
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite0 planet13 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 planet13)
   goals met: 0 of 8
5. (take_image satellite0 planet13 instrument1 image0)
   added: (have_image planet13 image0)
   goals met: 1 of 8
6. (turn_to satellite0 planet12 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet12)
   goals met: 1 of 8
7. (take_image satellite0 planet12 instrument1 spectrograph1)
   added: (have_image planet12 spectrograph1)
   goals met: 2 of 8
8. (turn_to satellite0 phenomenon14 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 phenomenon14)
   goals met: 2 of 8
9. (take_image satellite0 phenomenon14 instrument1 spectrograph1)
   added: (have_image phenomenon14 spectrograph1)
   goals met: 3 of 8
10. (turn_to satellite0 planet15 phenomenon14)
   deleted: (pointing satellite0 phenomenon14)
   added: (pointing satellite0 planet15)
   goals met: 3 of 8
11. (take_image satellite0 planet15 instrument1 spectrograph2)
   added: (have_image planet15 spectrograph2)
   goals met: 4 of 8
12. (turn_to satellite0 star10 planet15)
   deleted: (pointing satellite0 planet15)
   added: (pointing satellite0 star10)
   goals met: 4 of 8
13. (take_image satellite0 star10 instrument1 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 5 of 8
14. (turn_to satellite0 star11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star11)
   goals met: 5 of 8
15. (take_image satellite0 star11 instrument1 image0)
   added: (have_image star11 image0)
   goals met: 6 of 8
16. (turn_to satellite0 star16 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star16)
   goals met: 6 of 8
17. (take_image satellite0 star16 instrument1 spectrograph1)
   added: (have_image star16 spectrograph1)
   goals met: 7 of 8
18. (turn_to satellite0 star6 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 star6)
   goals met: 8 of 8
